<h1>Правила игры &laquo;Чёрная овечка&raquo;</h1>

<a href="https://evrikus.ru/catalog/good_92002328894/">Видеообзор</a>

<div class="rules-container">
    <h2>Цель игры</h2>
    <p>Соберите группы из&nbsp;3&nbsp;или 4&nbsp;одинаковых животных в&nbsp;своём зоопарке. Первый игрок, собравший нужное количество групп в&nbsp;своем зоопарке (для 2&nbsp;игроков&nbsp;5), побеждает.</p>
    <img src="../img/cards.png" alt="Карты" style="max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">

    <h2>Интерфейс и&nbsp;механики</h2>
    <img src="../img/r_1.png" alt="Интерфейс игры Чёрная овечка" style="max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
    <p>&laquo;Зоопарки игроков&raquo;&nbsp;&mdash; здесь можно выбрать игрока и&nbsp;вытянуть у&nbsp;него карту с&nbsp;помощью клика. Когда игрок выделяется синим цветом, это означает, что сейчас его ход.</p>
    <p>&laquo;Водопой&raquo;&nbsp;&mdash; сюда попадают вытянутые карты, откуда их&nbsp;можно забрать в&nbsp;свой зоопарк.</p>
    <p>Твой зоопарк&nbsp;&mdash; отображает собранные карты.</p>
    <p>&laquo;Твои карты на&nbsp;руках&raquo;&nbsp;&mdash; карты, которые можно положить в&nbsp;зоопарк и&nbsp;которые вытягивает твой соперник.</p>
    <img src="../img/r_2.png" alt="Интерфейс игры Чёрная овечка" style="max-width: 100%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
    <p>Справа внизу&nbsp;&mdash; игрок, чей ход, таймер, возможное количество карт для переноса в&nbsp;зоопарк. Кнопка &laquo;Карты в&nbsp;зоопарк&raquo; для переноса карт с&nbsp;водопоя и&nbsp;руки в&nbsp;зоопарк.</p>

    <h2>Как играть?</h2>
    <ol>
        <li>Нажми на&nbsp;игрока в&nbsp;разделе &laquo;Зоопарки игроков&raquo;, чтобы вытянуть у&nbsp;него случайную карту. Вытянутая карта переместится на&nbsp;&laquo;Водопой&raquo;.</li>
        <li>Ты&nbsp;можешь вытягивать карты до&nbsp;тех пор, пока не&nbsp;вытянута карточка <strong>Чёрной овечки</strong> (ход заканчивается без возможности положить карты в&nbsp;зоопарк, а&nbsp;вытянутые карты переходят в&nbsp;руку) или ты&nbsp;не&nbsp;нажал кнопку &laquo;Карты в&nbsp;зоопарк&raquo;.</li>
        <li>В&nbsp;зоопарк можно выкладывать только обычные животные. Положить карту в&nbsp;зоопарк можно простым кликом по&nbsp;ней, самое главное после выбора всех карт нажать на&nbsp;кнопку &laquo;Карты в&nbsp;зоопарк&raquo;. При выборе карт ориентируйтесь на&nbsp;поле К-во карт в&nbsp;зоопарк. Карточки особых животных не&nbsp;участвуют в&nbsp;выборе и&nbsp;остаются в&nbsp;игре.</li>
        <li>Чтобы собрать полный вид, нужно три одинаковых карты.</li>
        <li>Если таймер закончился, ход автоматически перейдет к&nbsp;следующему игроку, и&nbsp;все вытянутые карты окажутся у&nbsp;тебя на&nbsp;руках.</li>
    </ol>

    <h2>Особые животные</h2>
        <img src="../img/blacksheep.png" alt="Карта Черной овечки" style="max-width: 30%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
    <p><strong>Чёрная овечка</strong>: Если вытянута эта карточка, ход заканчивается, и&nbsp;активный игрок забирает все вытянутые карточки.</p>
    <div class="img_group">
        <img src="../img/eagle.png" alt="Карта Орла" style="max-width: 30%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
        <img src="../img/r_4.png" alt="Интерфейс игры Чёрная овечка" style="max-width: 68%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
    </div>
    <p><strong>Орёл</strong>: Активный игрок может спросить у&nbsp;любого другого игрока, есть&nbsp;ли у&nbsp;него определённое животное. Необходимо в&nbsp;форме выбрать нужного игрока и&nbsp;необходимый вид карты (от 1&nbsp;до&nbsp;12). Если есть, карточка кладётся на&nbsp;водопой, а&nbsp;орел улетает в&nbsp;руку. Если&nbsp;же нет, игроку необходимо выложить карты в&nbsp;зоопарк и&nbsp;передать ход следующему. Игрок также может выбрать не&nbsp;спрашивать игрока и&nbsp;продолжить вытягивать карты.</p>
    <div class="img_group">
        <img src="../img/mole.png" alt="Карта Орла" style="max-width: 30%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
        <img src="../img/r_3.png" alt="Интерфейс игры Чёрная овечка" style="max-width: 68%; height: auto; margin: 20px 0; border-radius: 8px; box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);">
    </div>
    <p><strong>Крот</strong>: Активный игрок может посмотреть карточки в&nbsp;руке игрока, у&nbsp;которого он&nbsp;ее&nbsp;вытянул, и&nbsp;взять одну карточку обычного животного себе на&nbsp;водопой.</p>

    <h2>Конец игры</h2>
    <p>Игра заканчивается, когда один из&nbsp;игроков собирает нужное количество групп животных:</p>
    <ul class="rules-list">
        <li>2&nbsp;игрока: 5&nbsp;групп</li>
        <li>3&nbsp;игрока: 4&nbsp;группы</li>
        <li>4&nbsp;или 5&nbsp;игроков: 3&nbsp;группы</li>
    </ul>
</div>




<!-- <h2>Особые животные</h2>
    <div class="card">
        <img src="../img/eagle.png" alt="Орёл">
        <p><strong>Орёл</strong>: Активный игрок может спросить у другого игрока, есть ли у него определённое животное. Если есть, карточка кладётся рядом с водопоем.</p>
    </div>
    <div class="card">
        <img src="../img/mole.png" alt="Крот">
        <p><strong>Крот</strong>: Активный игрок может посмотреть карточки в руке другого игрока и взять одну карточку обычного животного.</p>
    </div>
    <div class="card">
        <img src="../img/magpiethief.png" alt="Сорока-воровка">
        <p><strong>Сорока-воровка</strong>: Если игрок вытягивает Сороку-воровку, он может забрать одну карточку из зоопарка другого игрока.</p>
    </div>
    <div class="card">
        <img src="../img/blacksheep.png" alt="Чёрная овечка">
        <p><strong>Чёрная овечка</strong>: Если вытянута эта карточка, ход заканчивается, и активный игрок забирает все вытянутые карточки.</p>
    </div> -->